============================================
Comments
============================================

/*
Block comment with
multiple lines
*/

// Single line comment

// Multiple Single
// line comments

/* Single line block comment */

---

(source_file
  (multi_line_comment)
  (single_line_comment)
  (single_line_comment)
  (single_line_comment)
  (multi_line_comment))

============================================
Namespaces and identifiers
============================================

namespace Foo;

namespace Foo.Bar.Baz;

namespace Foo {}

namespace Foo {
  namespace Bar {
    namespace Baz {}
  }
}

---

(source_file
  (namespace_statement
    (plain_identifier))
  (namespace_statement
    (member_expression
      (plain_identifier)
      (plain_identifier)
      (plain_identifier)))
  (namespace_statement
    (plain_identifier))
  (namespace_statement
    (plain_identifier)
    (namespace_statement
      (plain_identifier)
      (namespace_statement
        (plain_identifier)))))

============================================
Imports and using statements
============================================

import "foo";
import "bar";

using Foo;
using Foo.Bar;

---

(source_file
  (import_statement
    (quoted_string_literal
      (quoted_string_fragment)))
  (import_statement
    (quoted_string_literal
      (quoted_string_fragment)))
  (using_statement
    (plain_identifier))
  (using_statement
    (member_expression
      (plain_identifier)
      (plain_identifier))))

============================================
Model heritage
============================================

model Foo {}

model Foo is A;

model Foo is A.B.C;

model Foo extends A.B.C {}

---

(source_file
  (model_statement
    (plain_identifier))
  (model_statement
    (plain_identifier)
    (model_is_heritage
      (reference_expression
        (plain_identifier))))
  (model_statement
    (plain_identifier)
    (model_is_heritage
      (reference_expression
        (member_expression
          (plain_identifier)
          (plain_identifier)
          (plain_identifier)))))
  (model_statement
    (plain_identifier)
    (model_extends_heritage
      (reference_expression
        (member_expression
          (plain_identifier)
          (plain_identifier)
          (plain_identifier))))))

============================================
Expressions
============================================

model Foo is A | B | C;

model Foo is A & B & C;

model Foo is A[] & valueof B | (C & D.A.B);

---

(source_file
  (model_statement
    (plain_identifier)
    (model_is_heritage
      (union_expression
        (union_expression
          (reference_expression
            (plain_identifier))
          (reference_expression
            (plain_identifier)))
        (reference_expression
          (plain_identifier)))))
  (model_statement
    (plain_identifier)
    (model_is_heritage
      (intersection_expression
        (intersection_expression
          (reference_expression
            (plain_identifier))
          (reference_expression
            (plain_identifier)))
        (reference_expression
          (plain_identifier)))))
  (model_statement
    (plain_identifier)
    (model_is_heritage
      (union_expression
        (intersection_expression
          (array_expression
            (reference_expression
              (plain_identifier)))
          (value_of_expression
            (reference_expression
              (plain_identifier))))
        (parenthesized_expression
          (intersection_expression
            (reference_expression
              (plain_identifier))
            (reference_expression
              (member_expression
                (plain_identifier)
                (plain_identifier)
                (plain_identifier)))))))))
